app/Controllers/Task.php

SELECT *
FROM `tasks`
---
    public function index()
    {
        $search = $this->request->getGet('search');
        $status = $this->request->getGet('status');

        $builder = $this->taskModel->builder();

        if ($search) {
            $builder->groupStart()
                ->like('title', $search)
                ->orLike('description', $search)
                ->groupEnd();
        }

        if ($status && in_array($status, ['pending', 'done'])) {
            $builder->where('status', $status);
        }

        $tasks = $builder->get()->getResultArray();

SELECT *
FROM `categories`
---
    public function create()
    {
        $categories = $this->categoryModel->findAll();

SELECT *
FROM `tasks`
WHERE `tasks`.`id` = '6'
SELECT *
FROM `categories`
---
    public function edit($id)
    {
        $task = $this->taskModel->find($id);

        if (!$task) {
            return redirect()->to('/task')->with('errors', ['Tarefa não encontrada.']);
        }

        $categories = $this->categoryModel->findAll();

SELECT *
FROM `tasks`
WHERE `tasks`.`id` = '11'
DELETE FROM `tasks`
WHERE `id` IN ('11')
---
    public function delete($id)
    {
        if ($this->taskModel->find($id)) {
            $this->taskModel->delete($id);

SELECT *
FROM `tasks`
WHERE `tasks`.`id` = '11'
---
    public function markDone($id)
    {
        $task = $this->taskModel->find($id);