app/Models/TaskModel.php

SELECT `categories`.*
FROM `categories`
JOIN `task_categories` ON `task_categories`.`category_id` = `categories`.`id`
WHERE `task_categories`.`task_id` = 6
---
    public function getCategories(int $taskId): array
    {
        $builder = $this->db->table('categories');
        $builder->select('categories.*');
        $builder->join('task_categories', 'task_categories.category_id = categories.id');
        $builder->where('task_categories.task_id', $taskId);

        return $builder->get()->getResultArray();

DELETE FROM `task_categories`
WHERE `task_id` = 7
INSERT INTO `task_categories` (`category_id`, `task_id`)
VALUES ('2',7)
---
    public function saveCategories(int $taskId, array $categoryIds): void
    {
        // Apaga os vínculos antigos
        $this->db->table('task_categories')->where('task_id', $taskId)->delete();

        // Prepara dados para inserir
        $data = [];
        foreach ($categoryIds as $categoryId) {
            $data[] = [
                'task_id' => $taskId,
                'category_id' => $categoryId,
            ];
        }

        if (!empty($data)) {
            // Insere todas de uma vez
            $this->db->table('task_categories')->insertBatch($data);

INSERT INTO `tasks` (`title`, `description`, `status`, `deadline`, `created_at`, `updated_at`) VALUES ('teste', 'teste', 'pending', '2025-06-27', '2025-06-15 22:17:28', '2025-06-15 22:17:28')
---
    public function insert($data = null, bool $returnID = true)
    {
        if (is_array($data) && isset($data['deadline']) && empty($data['deadline'])) {
            $data['deadline'] = null;
        }
        return parent::insert($data, $returnID);

UPDATE `tasks` SET `title` = 'Ir ao mercado', `description` = '', `status` = 'pending', `deadline` = '2025-06-28', `updated_at` = '2025-06-15 22:17:03'
WHERE `tasks`.`id` IN ('7')
---
    public function update($id = null, $data = null): bool
    {
        if (is_array($data) && isset($data['deadline']) && empty($data['deadline'])) {
            $data['deadline'] = null;
        }
        return parent::update($id, $data);